EMBEDONIX/STM32F103-ADC-VCP/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 *
 * COPYRIGHT(c) 2015 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"
#include "serial_debugger.h"
#include "packet.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
uint32_t ADCValues[4]; //buffer for DMA to write ADC values in it
CM_Packet packet;
uint8_t tx_DelayBase = 100; //Delay base between USB TX
uint32_t txDelay = 100;
uint8_t buttonsCount = 1;
uint8_t *bufferPtr = (uint8_t*)&packet; //pointer to start of buffer
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//Handle buttons ISR
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {

	//Here we see how many times each button is pressed

	//button PC2 increments the delay multiplier
	if(GPIO_Pin == GPIO_PIN_2) {
		buttonsCount++;

		if(buttonsCount > 14) {
			buttonsCount = 14;
		}
                
		packet.DelayRatio = buttonsCount;                
	}

	//button PC5 decrements the delay multiplier
	if(GPIO_Pin == GPIO_PIN_5) {
		buttonsCount--;

		if(buttonsCount < 1) {
			buttonsCount = 1;
		}
                
		packet.DelayRatio = buttonsCount;                
	}

        //update delay
	txDelay = tx_DelayBase * buttonsCount;
}
/* USER CODE END 0 */

int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_ADC1_Init();
	MX_USART2_UART_Init();
	MX_USB_DEVICE_Init();

	/* USER CODE BEGIN 2 */
	HAL_Delay(2000); //wait for USB init
	HAL_ADC_Start(&hadc1); //start ADC
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*) ADCValues, 4); //start ADC DMA

	//setup packet
	packet.DeviceId = 66;
        packet.DelayRatio = 1; //set packet delay ratio to 1
	CM_Init(&packet);
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

		//Delay depending on which button is pressed!		
                HAL_Delay(txDelay);
                
                //Add adc values to packet
                CM_AppendData(&packet, CM_VALUE_0, ADCValues[0]);
                CM_AppendData(&packet, CM_VALUE_1, ADCValues[1]);
                CM_AppendData(&packet, CM_VALUE_2, ADCValues[2]);
                CM_AppendData(&packet, CM_VALUE_3, ADCValues[3]);             

		//Write to VCP                
                CDC_Transmit_FS(bufferPtr, sizeof(packet));
		//while (CDC_Transmit_FS(bufferPtr, sizeof(packet)) != USBD_OK);

		//debug size of packet
		SD_PutString(USART2, "CM_Packet Size=");
		SD_PutNumber(USART2, sizeof(CM_Packet));
		SD_PutString(USART2, "\r\n");

		SD_PutString(USART2, "DelayRatio=");
		SD_PutNumber(USART2, buttonsCount);
		SD_PutString(USART2, "\r\n");

		//Debug ADCValues with USART2
		SD_PutString(USART2, "ADCValues[0]=");
		SD_PutNumber(USART2, packet.Value0);
		SD_PutString(USART2, "\r\n");

		SD_PutString(USART2, "ADCValues[1]=");
		SD_PutNumber(USART2,packet.Value1);
		SD_PutString(USART2, "\r\n");

		SD_PutString(USART2, "ADCValues[2]=");
		SD_PutNumber(USART2, packet.Value2);
		SD_PutString(USART2, "\r\n");

		SD_PutString(USART2, "ADCValues[3]=");
		SD_PutNumber(USART2, packet.Value3);
		SD_PutString(USART2, "\r\n");

	}
	/* USER CODE END 3 */

}

/** System Clock Configuration
 */
void SystemClock_Config(void) {

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInit;

	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC | RCC_PERIPHCLK_USB;
	PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
	PeriphClkInit.UsbClockSelection = RCC_USBPLLCLK_DIV1_5;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
